{
  "projects": [
    {
      "name": "Lab Assigner",
      "description": "an internal tool for Sabanci University instructors and students. involves 3 use cases for Admin, Instructor and Student user types. students register their preferred lab hours and instructors assign students to the lab hours via drag and drop in respect to students' preferences",
      "demoLink": "https://www.google.com",
      "codeLink": "https://github.com/Quadruple/InteractiveAssignmentTool",
      "techStack": ["react", "redux", "react-dnd", "node", "express", "php", "mysql", "oauth 2.0"]
    },
    {
      "name": "League of Tasks",
      "description": "it is Jira but competitive. you create tasks and move them to different states via drag and drop. you gain points for each finished task. you can see how productive other people in the leaderboard and motivate yourself to do more",
      "codeLink": "https://github.com/egebircan/JiraUniversal",
      "techStack": ["next.js", "typescript", "java", "docker", "react-beautiful-dnd", "spring-boot", "mongo"]
    },
    {
      "name": "egebircan.com",
      "description": "my portfolio website. i wanted to gather all my work, personal info and contact info together in one place and i wanted to be aesthetic so here we are. i ended up learning a lot about css, responsive design and mobile first approach",
      "techStack": ["next.js", "vercel"]
    },
    {
      "name": "CLI Twitter",
      "description": "a command line tool that lets you tweet without any time spent reading other people's tweets. i think the little 5 min twitter breaks really adds up and i wanted to reduce the damage. i was going to experiment with webdrivers anyway so this whole thing may be considered as an excuse",
      "codeLink": "https://github.com/egebircan/Commandline-Twitter",
      "demoLink": "https://www.google.com",
      "techStack": ["javascript", "selenium", "webdrivers"]
    },
    {
      "name": "Delete Twitter Likes",
      "description": "a simple script to delete all of your twitter likes at once. uses twitter-api under the hood so a twitter developer account is a requirement to use it ",
      "codeLink": "https://github.com/egebircan/BulkDeleteTwLikes",
      "techStack": ["javascript", "twitter-api"]
    }
  ]
}